[{"subject": "Question answer", "time": "Sunday, 27 December 2020, 4:28 PM", "context": "\nI will be in my office Monday afternoon 2-4 pm, if you want ask questions related to memory management, please come to my office\n"}, {"subject": "Office hours. ", "time": "Tuesday, 22 December 2020, 9:53 AM", "context": "\nDear allPlease feel free to join our office hours if you have any question or need help. Please make sure you use the updated slides and materials, you can download them from the Moodle. ** For the students who are still away, the online Q/A sessions are available to help you if you have any question. Please visit click here to participate in SEM/SET survey if you have not made this yet. Thanks \n"}, {"subject": "SET/SEM Survey is Back.", "time": "Thursday, 17 December 2020, 4:44 PM", "context": "\nDear allSET/SEM survey is back now. This was a problem with Moodle, and seems this is sorted out now :) Please visit click here to participate in the survey if you have not made this yet. Thanks \n"}, {"subject": "Revision slides", "time": "Monday, 14 December 2020, 11:44 AM", "context": "\nDear allRevision slides are now available. This could help you to see how the exam looks like!Good luck with your CW. The name of your zip file should be your username (according to the CW description), please ignore the pervious announcement for the naming(s). **** to participate in SET/SEM survey, please visit click here. Thanks \n"}, {"subject": "Exam revision and CW drop-in, Monday 2020-12-14", "time": "Sunday, 13 December 2020, 12:53 PM", "context": "\nDear allDue to receive a number of questions for the CW, we will have a CW drop-in session tomorrow after the revision lecture. \n *****Please join this session and revision tomorrow\r\nif you have any question or need help. I believe the sessions tomorrow would be\r\nvery helpful for you all.\nSee you.\n"}, {"subject": "Revision week ", "time": "Friday, 11 December 2020, 4:48 PM", "context": "\nDear allWe highly encourage you all to attend Monday 2020/12/14 sessions, focusing on OSC exam and Coursework. This is a very important lecture, as we will talk about the exam and the coursework submissions and you will have a chance to figure out lots of details then.See you all\n"}, {"subject": "**VERY VERY IMPORTANT: OSC Coursework ", "time": "Tuesday, 8 December 2020, 11:43 AM", "context": "\nDear allThe coursework submission link is now open under coursework section on OSC Moodle page. {Please click here, to see the submission page.}***Note- To avoid misunderstanding, the coursework deadline is updated to 15th December 2020, 00:05 AM, local time. This is a HARD deadline, so, I highly recommend you to submit the coursework as soon as possible.Please make sure submit your coursework as a single zip file, named, \"XXXXXXYYY\" where XXXXX is your student number and YYY is your first name.**** to participate in SET/SEM survey, please visit click here. ThanksSaeid\n"}, {"subject": "** IMPORTANT: SET/SEM survey", "time": "Monday, 7 December 2020, 11:15 AM", "context": "\nDear allThis is the time for SET/SEM survey. This is very important that you all spend 5 minutes aiming to participate in this survey.The survey is available here:https://bluecastle-cn-surveys.nottingham.ac.ukor you can click here to see the QR codes. Thanks Saeid and Qian\n"}, {"subject": "Lab sample codes and exam past papers", "time": "Wednesday, 2 December 2020, 10:23 AM", "context": "\nDear allThe sample codes for some of the lab tasks are now available on Moodle. Please have a look to see how they work.The past exam papers are now available, we will talk about the exam further, next week, during the revision session.Hope this helps  \n"}, {"subject": "OSC labs: lab activities ", "time": "Thursday, 26 November 2020, 4:39 PM", "context": "\nDear allAs we finished the lab tasks this week and according to the module schedule, there is no more lab left for the next weeks. Instead of this, we have organised drop-in sessions for the next two weeks, on Wednesdays 9-11 AM. Please join if you have any questions about OSC coursework. Sample answers for task 7 and 8 are now available on the Moodle. Hope this helps\n"}, {"subject": "Slides with Quizzes ", "time": "Monday, 23 November 2020, 11:36 AM", "context": "\nDear allAccording to our discussion today in the class, I will update the slides and add the quizzes after each lecture.  Slides for lecture 21 and 22 with quizzes are now available on the Moodle. Hope this helpsSaeid\n"}, {"subject": "Coursework Task1/b", "time": "Monday, 23 November 2020, 11:32 AM", "context": "\nDear allFurther to a question, regarding the sample output for Task1b, we checked the coursework description and found something unclear. To make this clear, please have a look below:There are two parts in Task1, one with SJF scheduling and another PQ. Task1a should be clear as SJF will be in charge of process scheduling. Task1b focuses on PQ queues which work according to RR scheduling. The processes are enqueued according to their priorities (PQs) and then scheduled one by one using RR for each queue. Indeed, PQ scheduling is used for different priority queues, whereas round robin algorithm (***not SJF****) should be used by the processes with the same priorities in each queue.The coursework description is updated and uploaded accordingly. Hope this helps\n"}, {"subject": "Coursework sample outputs", "time": "Friday, 20 November 2020, 8:25 PM", "context": "\nDear allPlease visit the Moodle page to see sample outputs for the coursework.Hope this helps\n"}, {"subject": "Sample outputs for OSC labs: task 5 and 6", "time": "Wednesday, 18 November 2020, 3:08 PM", "context": "\nDear allSample outputs for tasks 5 (a, b, c) and task 6 are now available on the Moodle. Hope this helpsSaeid\n"}, {"subject": "Lecture 20.", "time": "Monday, 16 November 2020, 11:30 AM", "context": "\nDear allI'm back, and going to deliver the remaining parts including deadlocks and file systems until the end of this semester. I updated lecture 20 slides with the quizzes and new deadlock examples. The examples explain further how deadlock detection algorithm works. Please use the new slides.hope this helpsSaeid\n"}, {"subject": "OSC Coursework ", "time": "Sunday, 15 November 2020, 11:36 AM", "context": "\nDear allOSC coursework is now released on the Moodle. This consists of two tasks focusing on process scheduling and publisher/consumer problem. Please carefully read the description to see all the required information of the tasks and submissions. Sample answers and required codes will be provided shortly.The deadline of this coursework is 14th December at 12:00 AM (china time). You *MUST* submit yours any time before the deadline. To avoid last minute conflicts and internet/platform problems, this is highly recommended to submit your coursework as soon as possible. If you have any question, please join our office hours.ThanksSaeid and Qian\n"}, {"subject": "Module schedule is updated. ", "time": "Thursday, 12 November 2020, 4:15 PM", "context": "\nDear allPlease see the module schedule updated here.Thanks Saeid\n"}, {"subject": "Early module feedback respond", "time": "Sunday, 8 November 2020, 9:48 PM", "context": "\nTo respond to comments on early module feedback, we are going to make the following changes:1. One additional hour is added to Thursday afternoon office hour, please check the moodle page for office hour detail.2. Exercises adding to slides.3. Lab solutions will be uploaded soon.Cheers,Qian Zhang\n"}, {"subject": "Saeid's Q/A resumes.", "time": "Monday, 2 November 2020, 11:41 PM", "context": "\nDear allTo inform you that, my office hours run until the end of semester as usual.I will be available in my office tomorrow (14:00-15:00) for Q/A. Please feel free to join me if you have any question from the previous lectures (except memory management which is by Qian).For the aboard students, I will be available online (tomorrow 15:00- 16:00) if you need help. Thanks Saeid\n"}, {"subject": "Feedback and announcement of OSC", "time": "Monday, 26 October 2020, 4:05 PM", "context": "\nHello everyone,Nice to see you today. As I said in the lecture, we will only have the Monday lecture session + lab session from this week to the end of this semester. Please refer to the schedule on the Moodle page.Up to now, it's already been more than one month since we started this semester.  We have gathered some feedback through different channels for this module. To follow up these comments:1. Here is some discontinuity due to the lecturer being away. As you may notice, we start wearing the remote mic during the lecture. Hope it helps. 2. The latest lab did not cover the latest material.We break the whole lab materials into different tasks with hierarchies, where later tasks are built upon the previous one. Tasks 1 & 2 are setting the context for later ones. We do hope you can pay attention to the exercise we provide and try to finish them in time. Otherwise, it will be more and more difficult for later tasks. Of course, you are always welcome to ask questions during the lab or office hours.3. The lecture being taught too fast.It is never enough to use only 2-3 lecture hours each week to learn a subject. We suggest you preview and review the slides before and after the class each week. We'd love to see that you come to class with questions and try to find those answers within the class. Besides, every subject of OSC has interconnections between one another, like process and memory, process and concurrency, etc.. It will be more and more difficult for you if there are uncleared contents or unsolved questions in previous weeks. We are providing after class exercise for you to check if you understand the content. Again, you are always welcome to ask questions. Thanks for your attention. The feedback channel is always open, and you are welcome to provide comments.Dr Qian Zhang\n"}, {"subject": "Office hours canclled for two weeks.", "time": "Sunday, 18 October 2020, 1:55 PM", "context": "\nDear allDue to an urgent issue, I wont be able to join you in Q/A office hours (both in-person and online) for two weeks (20th and 27th Sep.).Please feel free to email me, if you have any questions on teachings/labs or need help. I will manage to reply you ASAP.However, lectures and labs run as usual on Mondays, Tuesdays and Wednesdays.See you soon. Saeid\n"}, {"subject": "An update on Lab's guide.", "time": "Wednesday, 14 October 2020, 1:21 PM", "context": "\nDear allAn update made on the lab's guide, with the instructions to mount the home directory onto your laptop for both windows and mac/linux users. This is available on Moodle now.Hope this helpsSaeid\n"}, {"subject": "OSC labs", "time": "Tuesday, 13 October 2020, 1:29 PM", "context": "\nDear allTo remind you, our OSC labs get kicked off this Wednesday 2020.10.14, at 9-11 in PMB 432.Please have a look at the lab materials and guidance, available on Moodle, and learn how to setup the programming environment, and/or connect to CS linux server. The lab worksheet is also available there, this shows how OSC labs are going to be organised. Please feel free to bring in your laptops.Student who are still away, please try to get connected using UNNC VPN. Thanks see you tomorrow Saeid\n"}, {"subject": "An update on Lecture 4, 5", "time": "Monday, 5 October 2020, 11:48 AM", "context": "\nDear allHerewith is the update on lecture 4,5:1- Slide 29, Scheduling algorithms -Round Robin:\n\n\n\n\"E.g., a high throughput is achieved with a large time slice (e.g.\r\n1000ms) leads to increased response time.\" This means, response time is increased when processes utilise a longer time slice (1000). This is because the processes should wait for a longer time to take CPU for the first execution, and then get included for response time calculation. However, throughput is increased as the process get a better chance (and longer/sufficient time) to get finished when time slices are large. \n\n\n\n2- slide 27, quiz:\n\n\n\n\n\n\n\"Which one is True in process scheduling?\r\n\r\n\t\t\t\t\t\tA) Preemptive scheduling results in CPU monopolizing.\r\nB) Non-preemptive scheduling works well on batch systems.\r\nC) Frequent context-switch results in increased response time.\r\nD) Turnaround time is positively correlated with system throughput.\"\n\n\n\nTo explain why D is not true:If Turnaround time is increased, system throughput is reduced. This is because if the processes get finished for longer time, the number of finishing processes over a time unit (e.g. one hour) is reduced. Hence, Turnaround time is negatively correlated with system throughput!\n\n\n\nPlease find the updated/corrected slides on Moodle, for Lecture 4,5.Saeid\n"}, {"subject": "Lecture on Monday 2020.10.05", "time": "Saturday, 3 October 2020, 12:59 PM", "context": "\nDear allI hope you all had a great holiday, and back campus fresh. To inform you, we will resume the lectures, this Monday 2020.10.05, 9:00-11:00, DB-A05.Looking forward to see you all there.Have a good weekend Saeid\n"}, {"subject": "Welcome ", "time": "Friday, 18 September 2020, 3:07 PM", "context": "\nDear allWelcome to OSC module. This is good to see you at UNNC for the new semester. We will kick off this module on Monday 2020-09-21 at 9:00 AM, DB-A05. According to our schedule, OSC lectures will be on Mondays 9-11 and Tuesdays 10-11. Yet, we will have Labs on Wednesday 9-11, starting from week 4. You can find the full schedule on the Moodle page. Teaching materials will be available 24 hours before each session on Moodle. You can have a look and get ready for the lecture then. For the students who are still stranded abroad, this confirms that the lectures will be recorded and can be accessed on Moodle shortly after each teaching session. Please feel free to post your feedback, question and/or request on Moodle. Plus, you are welcome to come and see us during our office hours (Only Saeid is available until 6th Nov.). You can email us to make an appointment if need other timeslots. Have a great weekend.See you on MondaySaeid&Qian\n"}]