[{"subject": "ACE inclass exam: instructions for online students", "time": "Wednesday, 9 December 2020, 9:31 AM", "context": "\nDear all,Please ignore this email if you can take the ACE inclass exam in person in Auditorium. For those of you who need to take the exam online via Zoom, I have just sent you an email titled \"ACE inclass exam via Zoom\" providing the detailed instructions at 9.25 am today. If you did not receive it, please contact me immediately. Good luck with your inclass exam!Best wishes,Heshan   \n"}, {"subject": "Revision lecture next Week", "time": "Thursday, 3 December 2020, 2:22 PM", "context": "\nDear all,I will give a revision lecture next Monday so you have enough time to prepare for the ACE inclass exam on the 16th of December. After the revision lecture, I will talk about Priority Queue and heaps, which will not be covered in the inclass exam. All the lecture slides are available on Moodle now. Enjoy! Best wishes,Heshan\n"}, {"subject": "Student name list of online inclass exam via Zoom", "time": "Tuesday, 1 December 2020, 9:25 AM", "context": "\nDear all,Please ignore this email if you are on campus and can attend the ACE inclass exam in Auditorium. For students who need to take the inclass exam online via Zoom, please check whether your name is in the following list. FERDINAND,Kevin\nHADIAN,Gabrielle\r\n  Saputra\nHALIM,Ivan\r\n  Christian\nU-KING IM,Aurelie\r\n  Ines Siew Yin\nWONG,Wan Leng\r\n  Patricia\nIf not, please send me an email (including your name and student ID, and reasons for why you need to take the exam online) as soon as possible.  Thank you very much! Have a nice day! Best wishes,Heshan\n"}, {"subject": "ACE inclass exam", "time": "Friday, 27 November 2020, 4:45 PM", "context": "\n                            Dear all,Hope everything is going well for you. Our inclass exam will be on the 16th of December, 2-3pm, in Auditorium. The exam duration is 1 hour. All the questions are multiple choice questions. \"For each question, there are one or more correct answers. For each question, if all correct answers are selected and no incorrect ones are selected, then five marks will be awarded; otherwise, no mark will be awarded.\"I will talk about the inclass exam later in the lectures. Have a nice weekend! :-)Best wishes,Heshan\n"}, {"subject": "Change in Coursework 1 Question 2", "time": "Tuesday, 27 October 2020, 9:41 AM", "context": "\nDear all,Good morning! Based on the emails I received from you, I fixed a problem in Coursework 1 Question 2 (the file in the coursework folder is updated accordingly). Now the question is: \n\n\n\"Show that ⊢tot {y≤0} P {z=x × y} is valid.\"\n\n\nThe precondition now is y≤0. In the previous version, the precondition is T (tautology), which leads to a problem in the correctness proof. Good luck with your coursework!  Best wishes,Heshan\n"}, {"subject": "My office hours", "time": "Monday, 26 October 2020, 3:18 PM", "context": "\nDear all,As suggested by some of you, I changed my office hours to \"Mondays 2-3 pm, Tuesdays 10-11 am\"If you have any questions, feel free to ask me. Good luck with your ACE coursework! :-)Best wishes,Heshan\n"}, {"subject": "My Teaching Philosophy Statement", "time": "Thursday, 17 September 2020, 9:18 PM", "context": "\nDear all,I would like to share my teaching philosophy statement with you, so you know what I believe in teaching and learning. Please find my teaching philosophy statement available on the ACE module page. I will go through it briefly in our introduction lecture next Monday. Feel free to give me any comment and feedback. Thank you! Best wishes,Heshan\n"}, {"subject": "Welcome to ACE", "time": "Wednesday, 16 September 2020, 2:18 PM", "context": "\nDear all,I am Heshan Du, the module convenor of Algorithms Correctness and Efficiency (ACE). Welcome to join this module! We will have our first lecture next Monday (12:00 - 14:00, DB-A05). The tutorials and labs will start after the National Holiday. For all the lectures, tutorials and labs, we will have face-to-face sessions, live streaming via zoom at the same time, and recording available via Moodle and Panopto. For those of you who cannot join the face-to-face sessions, please join me via zoom (https://unnc.zoom.com.cn/j/7037427595). The slides of the first lecture are available on Moodle now. Enjoy! See you all next Monday! Best wishes,Heshan\n"}]