[{"subject": "When we can know the exam result", "time": "Sunday, 10 January 2021, 4:00 PM", "context": "\nWhen we can know the exam result\n"}, {"subject": "Inconsistency of Array-Based Representation of Binary Trees ", "time": "Wednesday, 16 December 2020, 3:05 AM", "context": "\n                            Hello Dr. HeshanI found the inconsistency of Array-Based Representation of Binary Trees between the textbook and the slidesIn the slide the root of the tree is stored in arr[1], however the textbook states that the root node is stored in arr[0]: (in p331- 332)Also I checked the slide on the official website: It has been updated too! (Link:Â http://bcs.wiley.com/he-bcs/Books?action=chapter&bcsId=8635&itemId=1118771338&chapterId=96667)So if in the exam there is some questions related to this array-based tree inplementation, which algorithm should I choose?Thanks!\n"}, {"subject": "Question of little o notation", "time": "Tuesday, 15 December 2020, 8:38 PM", "context": "\n                            Hello, Dr HeshanI search the Internet and found that some sources state the little o notation isğ‘“(ğ‘›) <= ğ‘ğ‘”(ğ‘›)Â  for all ğ‘› >= ğ‘›0 (less or equal to instead of strictly less than)For example, in WikipediaÂ inÂ Algorithms Illuminated Part 1 (p53)However inÂ Introduction to Algorithms, it is consistent with the slideSo I wanna know if both definition are right (i.e. <= and < are both right)Thanks!\n"}, {"subject": "a question about tutorial4", "time": "Tuesday, 15 December 2020, 3:05 PM", "context": "\nHi, professor. In question 1 of tutorial4. At enqueue 4 operation, you said the r = 1. But following the ppt, the r should be 0 because r is updated before next enqueue operation.\n"}, {"subject": "Question about primitive operation", "time": "Tuesday, 15 December 2020, 2:31 PM", "context": "\nDear Heshan,In lecture 5, there's a description about primitive operations. However, I am kind of confused about the second operation, that is \"following an object reference\".Â Can you give an example to explain what does it refer to?\n"}, {"subject": "About last year paper", "time": "Tuesday, 15 December 2020, 1:16 PM", "context": "\nHi Dr. HeShan,Can we get the last year's in-class exam paper? Thanks a lot!Regards,Yifei\n"}, {"subject": "Question about the best case of Quick sort", "time": "Monday, 14 December 2020, 11:58 PM", "context": "\nÂ Hi, professor. I'm not sure how to represent the best case running time of quick sort. The representation on the internet is Î©(n log n), but in ppt, it is O(n log n). So which one is correct or both are ok?\n"}, {"subject": "Question about uploading cw into Turinitin", "time": "Tuesday, 27 October 2020, 8:14 PM", "context": "\nHi, when I upload coursework 1 in the moodle, I got the error message shown in the img I attached. How can I deal with that?\n"}, {"subject": "Questions about the assignment rule in proof calculus", "time": "Saturday, 17 October 2020, 3:36 PM", "context": "\nDear Dr. Heshan,In the last lecture, you gave us an example of the assignment rule: {?} x=x+y {x=2 and y=1}. The precondition we got is {x+y=2 and y=1}. Hence, this Hoare Triple can be denoted asÂ {x+y=2 and y=1}Â x=x+y {x=2 and y=1}. However, from my perspective, the precondition should be {x=3 and y=1} since we assign x+y (2+1) to x and the value of y (1) is not changed. I'm confused about this example.Also, I don't fully understand why the assignment rule is used backward in proving correctness.Â Looking forward to your explanation :)\n"}, {"subject": "Prove the correctness of Euclid GCD algorithm", "time": "Thursday, 15 October 2020, 4:07 PM", "context": "\nWhen I read the book Computer science: a modern introduction, 3.3.2, on page 103-104, it gives the proof by induction of the GCD algorithm. However, in the Basis part of the induction, which is on page 104, I am confused about the sentence below:The equation gx' = mgy' + r also implies that r/g cannot have any factor in common with y', or else x' would have the same factor, which would contradict the fact that x' and y' have no common factors.Can anyone please help explain why x' and y' will have the same factor if r/g have the same factor with y'?The corresponding links for the pictures are down here.https://moodle.nottingham.ac.uk/pluginfile.php/6449073/mod_forum/post/1168869/IMG_8203.heichttps://moodle.nottingham.ac.uk/pluginfile.php/6449073/mod_forum/post/1168869/IMG_8204.heic\n"}, {"subject": "Questions about partial correctness and total correctness", "time": "Friday, 2 October 2020, 10:20 AM", "context": "\nDear Dr. Heshan,In the last lecture, you mentioned that the formal definition of \"correctness\" is \"for every legal input instance, if the required output is produced, we can say the algorithm for a specific problem is correct\". You also mentioned that we can simply refer to partial correctness as total correctness plus cases where the program doesn't terminate.However, for partial correctness, if the program cannot terminate, from my perspective the required output cannot be produced, hence we can not say that program is \"correct\" due to the definition of \"correctness\". I'm a little bit confused about this point.\n"}, {"subject": "inclass exam answers and marks", "time": "Monday, 22 February 2021, 5:48 PM", "context": "\nDear all,Happy New Year! Hope you all had a nice holiday.As requested by several students, I uploaded the inclass exam answers to the folder of Lecture 13. I corrected a small mistake in marking Question 5 (the correct answer should be \"b\", rather than \"b, d\"), which affects the marks of 38 students (as a result, for most of the 38 students, the mark is increased by 5; for the rest, the mark is reduced by 5).I re-uploaded the slides for mark distribution as well. Actually, around 30% students got a mark in the first class and around 60% got a mark in the upper second class or the first class . That is very good!Â Sorry for the mistakes I made. Now everything should be correct. :-)Have a nice evening and wishing everyone good health, happiness and success in your study in the new year!!Â Best wishes,Heshan\n"}, {"subject": "ACE make-up lecture on April 14th is rescheduled to March 31st", "time": "Tuesday, 23 February 2021, 10:22 AM", "context": "\nDear all,Please note that the ACE make-up lecture on April 14th (Wednesday, Week 31) is rescheduled to March 31st (Wednesday, Week 29).Time: 2-4 pmDate: March 31stRoom: DB-C05Thank you!Best regards,Jianfeng\n"}, {"subject": "inclass exam answers and marks", "time": "Monday, 22 February 2021, 5:48 PM", "context": "\nDear all,Happy New Year! Hope you all had a nice holiday.As requested by several students, I uploaded the inclass exam answers to the folder of Lecture 13. I corrected a small mistake in marking Question 5 (the correct answer should be \"b\", rather than \"b, d\"), which affects the marks of 38 students (as a result, for most of the 38 students, the mark is increased by 5; for the rest, the mark is reduced by 5).I re-uploaded the slides for mark distribution as well. Actually, around 30% students got a mark in the first class and around 60% got a mark in the upper second class or the first class . That is very good!Â Sorry for the mistakes I made. Now everything should be correct. :-)Have a nice evening and wishing everyone good health, happiness and success in your study in the new year!!Â Best wishes,Heshan\n"}, {"subject": "ACE make-up lecture on April 14th is rescheduled to March 31st", "time": "Tuesday, 23 February 2021, 10:22 AM", "context": "\nDear all,Please note that the ACE make-up lecture on April 14th (Wednesday, Week 31) is rescheduled to March 31st (Wednesday, Week 29).Time: 2-4 pmDate: March 31stRoom: DB-C05Thank you!Best regards,Jianfeng\n"}, {"subject": "inclass exam answers and marks", "time": "Monday, 22 February 2021, 5:48 PM", "context": "\nDear all,Happy New Year! Hope you all had a nice holiday.As requested by several students, I uploaded the inclass exam answers to the folder of Lecture 13. I corrected a small mistake in marking Question 5 (the correct answer should be \"b\", rather than \"b, d\"), which affects the marks of 38 students (as a result, for most of the 38 students, the mark is increased by 5; for the rest, the mark is reduced by 5).I re-uploaded the slides for mark distribution as well. Actually, around 30% students got a mark in the first class and around 60% got a mark in the upper second class or the first class . That is very good!Â Sorry for the mistakes I made. Now everything should be correct. :-)Have a nice evening and wishing everyone good health, happiness and success in your study in the new year!!Â Best wishes,Heshan\n"}, {"subject": "introduction lecture and inclass exam feedback", "time": "Friday, 19 February 2021, 12:03 PM", "context": "\nDear all,Happy New Year!! Hope you all had a nice holiday.Â In our first lecture next Monday, Jianfeng and I will provide an introduction of the topics in this semester and provide feedback for the inclass exam. The marks of the inclass exam have been released earlier today.Â For students who are not in campus, please join me via MS teams.Join \"COMP2048/AE2ACE 2021\" Microsoft Teams:Â obilk3xSee you all next week!Â Best wishes,Heshan\n"}, {"subject": "ACE inclass exam: instructions for online students", "time": "Wednesday, 9 December 2020, 9:31 AM", "context": "\nDear all,Please ignore this email if you can take the ACE inclass exam in person in Auditorium.Â For those of you who need to take the exam online via Zoom, I have just sent you an email titled \"ACE inclass exam via Zoom\" providing the detailed instructions at 9.25 am today. If you did not receive it, please contact me immediately.Â Good luck with your inclass exam!Best wishes,HeshanÂ  Â \n"}, {"subject": "Revision lecture next Week", "time": "Thursday, 3 December 2020, 2:22 PM", "context": "\nDear all,I will give a revision lecture next Monday so you have enough time to prepare for the ACE inclass exam on the 16th of December. After the revision lecture, I will talk about Priority Queue and heaps, which will not be covered in the inclass exam. All the lecture slides are available on Moodle now. Enjoy!Â Best wishes,Heshan\n"}, {"subject": "Student name list of online inclass exam via Zoom", "time": "Tuesday, 1 December 2020, 9:25 AM", "context": "\nDear all,Please ignore this email if you are on campus and can attend the ACE inclass exam in Auditorium.Â For students who need to take the inclass exam online via Zoom, please check whether your name is in the following list.Â FERDINAND,Kevin\nHADIAN,Gabrielle\r\n  Saputra\nHALIM,Ivan\r\n  Christian\nU-KING IM,Aurelie\r\n  Ines Siew Yin\nWONG,Wan Leng\r\n  Patricia\nIf not, please send me an email (including your name and student ID, and reasons for why you need to take the exam online) as soon as possible.Â  Thank you very much!Â Have a nice day!Â Best wishes,Heshan\n"}, {"subject": "ACE inclass exam", "time": "Friday, 27 November 2020, 4:45 PM", "context": "\n                            Dear all,Hope everything is going well for you.Â Our inclass exam will be on the 16th of December, 2-3pm, in Auditorium.Â The exam duration is 1 hour. All the questions are multiple choice questions.Â \"For each question, there are one orÂ more correct answers. For each question, if all correct answers are selectedÂ and no incorrect ones are selected, then five marks will be awarded; otherwise, no mark will be awarded.\"I will talk about the inclass exam later in the lectures. Have a nice weekend! :-)Best wishes,Heshan\n"}, {"subject": "Change in Coursework 1 Question 2", "time": "Tuesday, 27 October 2020, 9:41 AM", "context": "\nDear all,Good morning!Â Based on the emails I received from you, I fixed a problem in Coursework 1 Question 2 (the file in the coursework folder is updated accordingly). Now the question is:Â \n\n\n\"Show that âŠ¢tot {yâ‰¤0} P {z=x Ã— y} is valid.\"\n\n\nThe precondition now isÂ yâ‰¤0.Â In the previous version, the precondition is T (tautology), which leads to a problem in the correctness proof.Â Good luck with your coursework!Â Â Best wishes,Heshan\n"}, {"subject": "My office hours", "time": "Monday, 26 October 2020, 3:18 PM", "context": "\nDear all,As suggested by some of you, I changed my office hours toÂ \"Mondays 2-3 pm, Tuesdays 10-11 am\"If you have any questions, feel free to ask me.Â Good luck with your ACE coursework! :-)Best wishes,Heshan\n"}, {"subject": "My Teaching Philosophy Statement", "time": "Thursday, 17 September 2020, 9:18 PM", "context": "\nDear all,I would like to share my teaching philosophy statement with you, so you know what I believe in teaching and learning. Please find my teaching philosophy statement available on the ACE module page. I will go through it briefly in our introduction lecture next Monday. Feel free to give me any comment and feedback. Thank you!Â Best wishes,Heshan\n"}, {"subject": "Welcome to ACE", "time": "Wednesday, 16 September 2020, 2:18 PM", "context": "\nDear all,I am Heshan Du, the module convenor of Algorithms Correctness and Efficiency (ACE). Welcome to join this module!Â We will have our first lecture next Monday (12:00 - 14:00, DB-A05). The tutorials and labs will start after the National Holiday. For all the lectures, tutorials and labs, we will have face-to-face sessions, live streaming via zoom at the same time, and recording available via Moodle and Panopto. For those of you who cannot join the face-to-face sessions, please join me via zoom (https://unnc.zoom.com.cn/j/7037427595). The slides of the first lecture are available on Moodle now. Enjoy!Â See you all next Monday!Â Best wishes,Heshan\n"}]